tomyqg/STM32_RTT_F107/components/net/WIFI/usr_wifi232.c
/*****************************************************************************/
/* File      : usr_wifi232.c                                                 */
/*****************************************************************************/
/*  History:                                                                 */
/*****************************************************************************/
/*  Date       * Author          * Changes                                   */
/*****************************************************************************/
/*  2017-02-20 * Shengfeng Dong  * Creation of the file                      */
/*             *                 *                                           */
/*****************************************************************************/

/*****************************************************************************/
/*  Include Files                                                            */
/*****************************************************************************/
#ifdef RT_USING_SERIAL
#include "serial.h"
#endif /* RT_USING_SERIAL */
#include <rtdef.h>
#include <rtthread.h>
#include <rthw.h>
#include <stm32f10x.h>
#include "usr_wifi232.h"
#include "debug.h"
#include "string.h"
#include "stdio.h"
#include "stdlib.h"

/*****************************************************************************/
/*  Variable Declarations                                                    */
/*****************************************************************************/
extern struct rt_device serial5;		//串口1为WIFI收发串口
#define RD_DELAY 	(RT_TICK_PER_SECOND/2) //读取数据延时
#define WR_DELAY	(RT_TICK_PER_SECOND) //写数据延时
#define WIFI_SERIAL (serial5)
rt_mutex_t WIFI_lock = RT_NULL;
extern int WiFiReadFlag;
static int WiFireadtimeoutflag = 0;

/*****************************************************************************/
/*  Function Implementations                                                 */
/*****************************************************************************/

//定时器超时函数
static void readtimeout_Wifi(void* parameter)
{
	WiFireadtimeoutflag = 1;
}

int selectWiFi(int timeout)			//Wifi串口数据检测 返回0 表示串口没有数据  返回1表示串口有数据
{	
	rt_timer_t readtimer;
	readtimer = rt_timer_create("read", /* 定时器名字为 read */
					readtimeout_Wifi, /* 超时时回调的处理函数 */
					RT_NULL, /* 超时函数的入口参数 */
					timeout*RT_TICK_PER_SECOND, /* 定时时间长度,以OS Tick为单位*/
					 RT_TIMER_FLAG_ONE_SHOT); /* 单周期定时器 */
	if (readtimer != RT_NULL) rt_timer_start(readtimer);
	WiFireadtimeoutflag = 0;
	while(1)
	{
		if(WiFireadtimeoutflag)
		{
			rt_timer_delete(readtimer);
			return 0;
		}else 
		{
			rt_hw_us_delay(1);
			if(WiFiReadFlag == 1)	//串口数据监测,如果有数据则返回1
			{
				rt_timer_delete(readtimer);
				rt_thread_delay(RT_TICK_PER_SECOND/2);
				return 1;
			}
		}
	}
}

void clear_WIFI(void)		//清空串口缓冲区的数据
{
	char *data = NULL;
	data = malloc(2048);
	
	//清空缓冲器代码	通过将接收缓冲区的所有数据都读取出来，从而清空数据
	WIFI_SERIAL.read(&WIFI_SERIAL,0, data, 2048);
	free(data);
	//rt_thread_delay(RT_TICK_PER_SECOND/10);
}


//WIFI串口打开函数
int WiFi_Open(void)
{
	int result = 0;
	GPIO_InitTypeDef GPIO_InitStructure;
	rt_device_t new;

	WIFI_lock = rt_mutex_create("wifi_lock", RT_IPC_FLAG_FIFO);
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_GPIOA,ENABLE);
	GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_6;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	GPIO_SetBits(GPIOC, GPIO_Pin_6);		//设置引脚为高电平输出，使能WIFI模块
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_8;
	GPIO_Init(GPIOA, &GPIO_InitStructure);	
	
	new = rt_device_find("uart5");		//寻找WIFI串口并配置模式
	if (new != RT_NULL)
	{
		result = rt_device_open(new, RT_DEVICE_OFLAG_RDWR | RT_DEVICE_FLAG_INT_RX);
		
		if(result && WIFI_STATUS)
		{
			printdecmsg(ECU_DBG_WIFI,"open WIFI failed ",result);
		}
	}
	rt_thread_delay(RT_TICK_PER_SECOND);
	//直到WIFI连接上之后   算成功打开
	while(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8));
	
	if (WIFI_lock != RT_NULL)
	{
		rt_thread_delay(RT_TICK_PER_SECOND*5);
		printmsg(ECU_DBG_WIFI,"open WIFI success!!!!!!!!!!!!");
	}
	rt_mutex_release(WIFI_lock);
	return result;
}

//进入AT模式 进入AT模式		OK
int AT(void)
{
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	//先向模块写入"+++"然后再写入"a" 写入+++返回"a" 写入"a"返回+ok
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,"+++", 3);
	//获取到a
	if(selectWiFi(1) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%d %s\n",length,AT);
		if(memcmp(AT,"a",1))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	//发送数据a
	clear_WIFI();
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,"a", 1);
	if(selectWiFi(1) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT WIFI Get reply time out 2");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		memset(AT,0x00,255);
	  WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%d %s\n",length,AT);
		if(memcmp(AT,"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"Into AT Mode");
	rt_mutex_release(WIFI_lock);
	return 0;
}

//切换回原来的工作模式    OK
int AT_ENTM(void)
{
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	//向模块写入"AT+ENTM\n",返回+ok
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,"AT+ENTM\n", 8);
	//获取到a
	if(selectWiFi(1) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_ENTM WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		if(memcmp(&AT[9],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"Into AT_ENTM Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}

//AT 模式下所需要的相关命令

//USR的版本信息			OK
int AT_VER(void)
{
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	//向模块写入"AT+ENTM\n",返回+ok
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,"AT+VER\n", 7);
	//获取到a
	if(selectWiFi(1) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_VER WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		if(memcmp(&AT[8],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	print2msg(ECU_DBG_WIFI,"Version",AT);
	rt_mutex_release(WIFI_lock);
	return 0;
}
//复位模块			OK
int AT_Z(void)
{
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	//向模块写入"AT+AT_Z\n",返回+ok
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,"AT+Z\n", 5);

	if(selectWiFi(1) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_Z WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		if(memcmp(&AT[6],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	rt_thread_delay(RT_TICK_PER_SECOND*1);
	while(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8));
	
