tomyqg/STM32_RTT_F107/components/net/WIFI/usr_wifi232.c
	rt_mutex_release(WIFI_lock);
	//rt_thread_delay(RT_TICK_PER_SECOND*18);
	printmsg(ECU_DBG_WIFI,"AT_Z Successful");
	return 0;
}

//恢复出厂设置
int AT_RELD(void)
{
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	//向模块写入"AT+AT_Z\n",返回+ok
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,"AT+RELD\n", 8);
	rt_thread_delay(RT_TICK_PER_SECOND*3);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_RELD WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%s\n",AT);
		if(memcmp(&AT[9],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_RELD Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}

//配置SOCKET A 服务器地址
int AT_NETP(char *IP,int port)
{
	char send[50] = {'\0'};
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	
	sprintf(send,"AT+NETP=TCP,Server,%d,%s\n",port,IP);
	//向模块写入"AT_NETP\n",返回+ok
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, (strlen(send)));
	rt_thread_delay(RT_TICK_PER_SECOND);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_NETP WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%s\n",AT);
		if(memcmp(&AT[strlen(send)+1],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_NETP Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}

//配置SOCKET B 开启
int AT_TCPB_ON(void)
{
	char send[50] = {'\0'};
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	
	sprintf(send,"AT+TCPB=on\n");
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, (strlen(send)));
	rt_thread_delay(RT_TICK_PER_SECOND);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_TCPB_ON WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%d %s\n",strlen(send),AT);
		if(memcmp(&AT[strlen(send)+1],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_TCPB_ON Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}


//配置SOCKET B IP地址
int AT_TCPADDB(char *IP)
{
	char send[50] = {'\0'};
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	
	sprintf(send,"AT+TCPADDB=%s\n",IP);
	//向模块写入"AT_TCPADDB\n",返回+ok
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, (strlen(send)));
	rt_thread_delay(RT_TICK_PER_SECOND);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_TCPADDB WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%s\n",AT);
		if(memcmp(&AT[strlen(send)+1],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_TCPADDB Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}


//配置SOCKET B IP端口
int AT_TCPPTB(int port)
{
	char send[50] = {'\0'};
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	
	sprintf(send,"AT+TCPPTB=%d\n",port);
	//向模块写入"AT_NETP\n",返回+ok
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, (strlen(send)));
	rt_thread_delay(RT_TICK_PER_SECOND);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_TCPPTB WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%s\n",AT);
		if(memcmp(&AT[strlen(send)+1],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_TCPPTB Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}

//配置SOCKET B 超时时间
int AT_TCPTOB(int timeout)
{
		char send[50] = {'\0'};
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	
	sprintf(send,"AT+TCPTOB=%d\n",timeout);
	//向模块写入"AT_TCPTOB\n",返回+ok
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, (strlen(send)));
	rt_thread_delay(RT_TICK_PER_SECOND);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_TCPTOB WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%s\n",AT);
		if(memcmp(&AT[strlen(send)+1],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_TCPTOB Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}

//配置SOCKET C 超时时间
int AT_TCPTOC(int timeout)
{
		char send[50] = {'\0'};
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	
	sprintf(send,"AT+TCPTOC=%d\n",timeout);
	//向模块写入"AT_TCPTOB\n",返回+ok
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, (strlen(send)));
	rt_thread_delay(RT_TICK_PER_SECOND);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_TCPTOC WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		printf("%s\n",AT);
		if(memcmp(&AT[strlen(send)+1],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_TCPTOC Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}

//配置SOCKET B 开启
int AT_TCPC_ON(void)
{
	char send[50] = {'\0'};
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	
	sprintf(send,"AT+TCPC=on\n");
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, (strlen(send)));
	rt_thread_delay(RT_TICK_PER_SECOND);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_TCPC_ON WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%s\n",AT);
		if(memcmp(&AT[strlen(send)+1],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_TCPC_ON Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}

//配置SOCKET C IP地址
int AT_TCPADDC(char *IP)
{
	char send[50] = {'\0'};
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	
	sprintf(send,"AT+TCPADDC=%s\n",IP);
	//向模块写入"AT_NETP\n",返回+ok
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, (strlen(send)));
	rt_thread_delay(RT_TICK_PER_SECOND);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_TCPADDC WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%s\n",AT);
		if(memcmp(&AT[strlen(send)+1],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_TCPADDC Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}

//配置SOCKET C IP端口
int AT_TCPPTC(int port)
{
	char send[50] = {'\0'};
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	
	sprintf(send,"AT+TCPPTC=%d\n",port);
	//向模块写入"AT_NETP\n",返回+ok
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, (strlen(send)));
	rt_thread_delay(RT_TICK_PER_SECOND);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_TCPPTC WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%s\n  %s\n",send,AT);
		if(memcmp(&AT[strlen(send)+1],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_TCPPTC Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}



//开启AP+STA功能模式
int AT_FAPSTA_ON(void)
{
	char send[50] = {'\0'};
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	
	sprintf(send,"AT+FAPSTA=on\n");
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, (strlen(send)));
	rt_thread_delay(RT_TICK_PER_SECOND*2);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_FAPSTA_ON WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%s\n",AT);
		if(memcmp(&AT[strlen(send)+1],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_FAPSTA_ON Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}
//设置WIFI工作模式  STA or AP
int AT_WMODE(char *WMode)
{
	char send[50] = {'\0'};
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	
	sprintf(send,"AT+WMODE=%s\n",WMode);
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, (strlen(send)));
	rt_thread_delay(RT_TICK_PER_SECOND);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_WMODE WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%s\n",AT);
		if(memcmp(&AT[strlen(send)+1],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_WMODE Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}
//设置连接路由器SSID
int AT_WSSSID(char *SSSID)
{
	char send[50] = {'\0'};
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	
	sprintf(send,"AT+WSSSID=%s\n",SSSID);
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, (strlen(send)));
	rt_thread_delay(RT_TICK_PER_SECOND);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_WSSSID WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%s\n",AT);
		if(memcmp(&AT[strlen(send)+1],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_WSSSID Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}
//设置连接路由器KEY
int AT_WSKEY(char *SKEY)
{
	char send[50] = {'\0'};
	char AT[255] = { '\0' };
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	clear_WIFI();
	
