tomyqg/STM32_RTT_F107/components/net/WIFI/usr_wifi232.c
	sprintf(send,"AT+WSKEY=WPA2PSK,AES,%s\n",SKEY);
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, (strlen(send)));
	rt_thread_delay(RT_TICK_PER_SECOND);
	if(selectWiFi(2) <= 0)
	{
		printmsg(ECU_DBG_WIFI,"AT_WSKEY WIFI Get reply time out 1");
		rt_mutex_release(WIFI_lock);
		return -1;
	}
	else
	{
		WIFI_SERIAL.read(&WIFI_SERIAL,0, AT, 255);
		//printf("%s\n",AT);
		if(memcmp(&AT[strlen(send)+1],"+ok",3))
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	printmsg(ECU_DBG_WIFI,"AT_WSKEY Successful");
	rt_mutex_release(WIFI_lock);
	return 0;
}



//在串口指令模式下接收数据
static int WiFi_RecvData(int timeout,char *data)
{
	int length = 0;
	if(data == RT_NULL)
	{
			return -1;
	}
	if(selectWiFi(timeout) <= 0)
	{
		//printmsg(ECU_DBG_WIFI,"WIFI Get reply time out");
		return -1;
	}
	else
	{
		length = WIFI_SERIAL.read(&WIFI_SERIAL,0, data, 2048);
		//printhexmsg(ECU_DBG_WIFI,"WiFi_RecvData", data, length);
		//printf("length : %d  %s\n",length,&data[9]);
		return length;
	}
}

char socketdata[2048] = {'\0'};
char dataA[2048] = {'\0'};	//缓存从SOCKET A读到的数据  最后一次收到的的
int lengthA = 0;						//缓存SOCKET A读到的数据长度
char dataB[2048] = {'\0'};	//缓存从SOCKET B读到的数据	最后一次收到的的
int lengthB = 0;						//缓存SOCKET B读到的数据长度 
char dataC[2048] = {'\0'};	//缓存从SOCKET C读到的数据	最后一次收到的的
int lengthC = 0;						//缓存SOCKET C读到的数据长度 

int RecvSocketData(SocketType Type,char *data,int timeout)
{
	int i=0;
	int length = 0;
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	if(data == RT_NULL)
	{
			rt_mutex_release(WIFI_lock);
			return -1;
	}
	for(i = 0;i<3;i++)
	{
		//首先查看3路是否有数据
		switch(Type)
		{
			case SOCKET_A:
				if(lengthA != 0)
				{
					memcpy(data,dataA,lengthA);
					data[lengthA] = '\0';
					length = lengthA;
					lengthA = 0;
					rt_mutex_release(WIFI_lock);
					return length;
				}
				break;
			case SOCKET_B:
				if(lengthB != 0)
				{
					memcpy(data,dataB,lengthB);
					data[lengthB] = '\0';
					length = lengthB;
					lengthB = 0;
					rt_mutex_release(WIFI_lock);
					return length;
				}
				break;
			case SOCKET_C:
				if(lengthC != 0)
				{
					memcpy(data,dataC,lengthC);
					data[lengthC] = '\0';
					length = lengthC;
					lengthC = 0;
					rt_mutex_release(WIFI_lock);
					return length;
				}
				break;
		}
		
		//3路都不存在数据的情况下，读取一条数据
		memset(socketdata,0x00,2048);
		if((length = WiFi_RecvData(timeout,socketdata)) > 0)
		{			
			switch(socketdata[0])
			{
				case 'a':
					memset(dataA,0x00,2048);
					memcpy(dataA,socketdata,length);
					lengthA = length;
					printdecmsg(ECU_DBG_WIFI,"a ",lengthA);
					print2msg(ECU_DBG_WIFI,"a ",&dataA[9]);
					break;
				case 'b':
					memset(dataB,0x00,2048);
					memcpy(dataB,socketdata,length);
					lengthB = length;
					printdecmsg(ECU_DBG_WIFI,"b ",lengthB);
					print2msg(ECU_DBG_WIFI,"b ",&dataB[9]);
					break;
				case 'c':
					memset(dataC,0x00,2048);
					memcpy(dataC,socketdata,length);
					lengthC = length;
					printdecmsg(ECU_DBG_WIFI,"c ",lengthC);
					print2msg(ECU_DBG_WIFI,"c ",&dataC[9]);
					break;
			}
		}else
		{
			rt_mutex_release(WIFI_lock);
			return -1;
		}
	}
	rt_mutex_release(WIFI_lock);
	return -1;
	
}


int SendToSocketA(char *data ,int length,char ID[8])
{
	char *sendbuff = NULL;
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	sendbuff = malloc(4096);
	sprintf(sendbuff,"a%c%c%c%c%c%c%c%c",ID[0],ID[1],ID[2],ID[3],ID[4],ID[5],ID[6],ID[7]);
	memcpy(&sendbuff[9],data,length);
	clear_WIFI();
	lengthB = 0;
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,sendbuff, (length+9));

	free(sendbuff);
	sendbuff = NULL;
	rt_thread_delay(RT_TICK_PER_SECOND/4);
	rt_mutex_release(WIFI_lock);
	return 0;
}


int SendToSocketB(char *data ,int length)
{
	char *sendbuff = NULL;
	if((1 == WIFI_QueryStatus(SOCKET_B)) || (0 == WIFI_Create(SOCKET_B)))
	{
		rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
		sendbuff = malloc(4096);
		sprintf(sendbuff,"b00000000");
		memcpy(&sendbuff[9],data,length);
		
		clear_WIFI();
		lengthB = 0;
		WIFI_SERIAL.write(&WIFI_SERIAL, 0,sendbuff, (length+9));

		free(sendbuff);
		sendbuff = NULL;
		rt_thread_delay(RT_TICK_PER_SECOND);
		rt_mutex_release(WIFI_lock);
		return 0;
	}
	return -1;
}

int SendToSocketC(char *data ,int length)
{
	int i = 0;
	char *sendbuff = NULL;
	char msg_length[6] = {'\0'};
	if((1 == WIFI_QueryStatus(SOCKET_C)) || (0 == WIFI_Create(SOCKET_C)))
	{
		rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
		sendbuff = malloc(4096);

		if(data[strlen(data)-1] == '\n'){
			sprintf(msg_length, "%05d", strlen(data)-1);
		}
		else{
			sprintf(msg_length, "%05d", strlen(data));
			strcat(data, "\n");
		}
		strncpy(&data[5], msg_length, 5);

		
		print2msg(ECU_DBG_WIFI,"SendToSocketC",data);
		sprintf(sendbuff,"c00000000");
		memcpy(&sendbuff[9],data,length);
		clear_WIFI();
		lengthC = 0;
		for(i = 0;i<(length+9);i++)	
		{
			printf("%x ",sendbuff[i]);
		}
		printf("\n");

		WIFI_SERIAL.write(&WIFI_SERIAL, 0,sendbuff, (length+9));

		free(sendbuff);
		sendbuff = NULL;
		rt_thread_delay(RT_TICK_PER_SECOND);
		rt_mutex_release(WIFI_lock);
		return 0;
	}
	return -1;
}

//串口指令模式下收发数据
//在串口指令模式下发送数据    发送TCP报文
int WiFi_SendData(tcp_address_t address ,char *data ,int length)   
{
	int domain_length = 0,msg_length = 0,index = 0;
	unsigned char check_sum = 0;
	char tcp_msg[256];
	if ((data == RT_NULL) || (length <= 0))
	{
		printmsg(ECU_DBG_WIFI,"WIFI_SendData failed ...");
		return -1;
	}
	
	tcp_msg[0] = 0x55;
	tcp_msg[1] = 0xAA;
	
	if(address.address_type == TYPE_IP)
	{
		tcp_msg[4] = 0x03;
		
		tcp_msg[9] = address.address.ip[3]; 
		tcp_msg[10] = address.address.ip[2];
		tcp_msg[11] = address.address.ip[1];
		tcp_msg[12] = address.address.ip[0];
		msg_length =  5 + 4 + length;
		tcp_msg[2] = msg_length/256;
		tcp_msg[3] = msg_length%256;
		rt_memcpy(&tcp_msg[13],data,length);
	}else if(address.address_type == TYPE_DOMAIN)
	{
		tcp_msg[4] = 0x03;
		domain_length = rt_strlen(address.address.domain);
		rt_memcpy(&tcp_msg[9],address.address.ip,domain_length);
		tcp_msg[9+domain_length] = '\0';
		domain_length++;
		msg_length =  5 + domain_length + length;
		tcp_msg[2] = msg_length/256;
		tcp_msg[3] = msg_length%256;
		rt_memcpy(&tcp_msg[9+domain_length],data,length);
	}else
	{
		printmsg(ECU_DBG_WIFI,"WIFI_SendData failed ...");
		return -2;
	}
	
	tcp_msg[5] = 0x00;
	tcp_msg[6] = 0x00;
	tcp_msg[7] = address.port%256;
	tcp_msg[8] = address.port/256;
	
	for(index = 0 ; index < msg_length ; index++)
	{
		check_sum += tcp_msg[index+4]; 
	}
	tcp_msg[4+msg_length] = check_sum;
	
