tomyqg/STM32_RTT_F107/components/net/WIFI/usr_wifi232.c
	WIFI_SERIAL.write(&WIFI_SERIAL, 0,tcp_msg, (msg_length+5));
	
	//printhexmsg("wifi","WiFi_SendData", (char *)tcp_msg, (msg_length+5));
	return 	(msg_length+5);
}


//初始化WIFI模块为工作模式  //工作模式 socketB 和socketC为 client和Control_Client服务器配置信息
int initWorkIP(char *clientIP,int clientPort,char *controlIP,int controlPort)
{
	int i = 0,res = 0;
	
	//进入AT模式
	rt_thread_delay(RT_TICK_PER_SECOND*3);
	for(i = 0;i<3;i++)
	{
		if(0 == AT())
		{//进入AT模式成功
			//printf("AT Successful\n");
			res = 0;
			break;
		}else
		{//进入AT模式失败，尝试先退出AT模式。
			//printf("AT Failed,AT_ENTM\n");
			res = -1;
			AT_ENTM();
		}
	}
	if(res == -1) return -1;
	//只有在进入AT模式之后才能进行后续的操作
	//打开SOCKET B功能
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPB_ON())
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;	
	//配置SOCKET B的服务器IP地址
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPADDB(clientIP))
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	
	//配置SOCKET B的服务器端口号
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPPTB(clientPort))
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	
	//打开SOCKET C功能
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPC_ON())
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	
	//配置SOCKET C的服务器IP地址
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPADDC(controlIP))
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	//配置SOCKET C的服务器端口号
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPPTC(controlPort))
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	
	//配置SOCKET C的服务器超时时间
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPTOB(600))
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	
	//配置SOCKET C的服务器超时时间
	for(i = 0;i<3;i++)
	{
		if(0 == AT_TCPTOC(600))
		{
			res = 0;
			break;
		}else
			res = -1;
	}
	if(res == -1) return -1;
	
	for(i = 0;i<2;i++)
	{
		if(0 == AT_Z())
			break;
	}
	printmsg(ECU_DBG_WIFI,"initWorkIP Over");
	return 0;
}

//创建Socket连接
//返回0 表示创建连接成功  -1表示失败
int WIFI_Create(SocketType Type)
{
	char send[50] = {'\0'};
	char recv[255] = { '\0' };
	int i = 0;
	int length = 0;
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	
	send[0]= 0x65;
	if(Type == SOCKET_B)
		send[1]= 0x62;
	else if(Type == SOCKET_C)
		send[1]= 0x63;
	else
		return -1;
	
	send[2]= 0x06;
	send[3]= 0x01;
	send[4]= 0x00;
	send[5]= 0x02;
	for(i = 0;i<2;i++)
	{
		clear_WIFI();
		WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, 6);
		//printhexmsg(ECU_DBG_WIFI,"WIFI_CreateSocket send", send, 6);
		
		if(selectWiFi(10) <= 0)
		{
			printmsg(ECU_DBG_WIFI,"WIFI_CreateSocket WIFI Get reply time out 1");
		}
		else
		{
			length = WIFI_SERIAL.read(&WIFI_SERIAL,0, recv, 255);
			//printhexmsg(ECU_DBG_WIFI,"WIFI_CreateSocket", recv, length);
			if((length > 0) && 
				  (recv[0] == 0x65)&&
					(recv[1] == send[1])&&
					(recv[2] == 0x06)&&
					(recv[4] == 0x01)
				)
			{
				//创建连接成功
				printmsg(ECU_DBG_WIFI,"WIFI_CreateSocket Successful");
				rt_mutex_release(WIFI_lock);
				rt_thread_delay(RT_TICK_PER_SECOND);
				return 0;
			}else
			{
				//创建连接失败
				printmsg(ECU_DBG_WIFI,"WIFI_CreateSocket Failed");
				//rt_mutex_release(WIFI_lock);
				//return -1;
			}
		}
	}
	rt_mutex_release(WIFI_lock);
	return -1;
}

//关闭Socket连接
//返回0 表示关闭连接成功  -1表示失败
int WIFI_Close(SocketType Type)
{
	char send[50] = {'\0'};
	char recv[255] = { '\0' };
	int length = 0, i = 0;
	if(1 != WIFI_QueryStatus(Type))
		return -1;

	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	
	send[0]= 0x65;
	if(Type == SOCKET_B)
		send[1]= 0x62;
	else if(Type == SOCKET_C)
		send[1]= 0x63;
	else
		return -1;
	
	send[2]= 0x06;
	send[3]= 0x02;
	send[4]= 0x00;
	send[5]= 0x03;

	for(i = 0;i<2;i++)
	{
		clear_WIFI();
		WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, 6);
		//printhexmsg(ECU_DBG_WIFI,"WIFI_CloseSocket send", send, 6);
		
		if(selectWiFi(5) <= 0)
		{
			printmsg(ECU_DBG_WIFI,"WIFI_CloseSocket WIFI Get reply time out 1");

		}
		else
		{
			length = WIFI_SERIAL.read(&WIFI_SERIAL,0, recv, 255);
			//printhexmsg(ECU_DBG_WIFI,"WIFI_CloseSocket", recv, length);
			if( (length > 0) && 
				  (recv[0] == 0x65)&&
					(recv[1] == send[1])&&
					(recv[2] == 0x06)&&
					(recv[4] == 0x01)
				)
			{
				//关闭连接成功
				printmsg(ECU_DBG_WIFI,"WIFI_CloseSocket Successful");
				rt_mutex_release(WIFI_lock);
				return 0;
			}else
			{
				//关闭连接失败
				printmsg(ECU_DBG_WIFI,"WIFI_CloseSocket Failed");
				//rt_mutex_release(WIFI_lock);
				//return -1;
			}
		}

	}
	rt_mutex_release(WIFI_lock);
	return -1;

}

//查询连接状态
//返回1：表示当前在线  0：表示当前不在线   -1：表示查询失败
int WIFI_QueryStatus(SocketType Type)
{
	char send[50] = {'\0'};
	char recv[255] = { '\0' };
	int length = 0, i = 0;
	rt_mutex_take(WIFI_lock, RT_WAITING_FOREVER);
	
	send[0]= 0x65;
	if(Type == SOCKET_B)
		send[1]= 0x62;
	else if(Type == SOCKET_C)
		send[1]= 0x63;
	else
		return -1;
	
	send[2]= 0x06;
	send[3]= 0x03;
	send[4]= 0x00;
	send[5]= 0x04;

	for(i = 0;i<2;i++)
	{
		clear_WIFI();
		WIFI_SERIAL.write(&WIFI_SERIAL, 0,send, 6);
		//printhexmsg(ECU_DBG_WIFI,"WIFI_QuerySocketStatus send", send, 6);
		
		if(selectWiFi(5) <= 0)
		{
			printmsg(ECU_DBG_WIFI,"WIFI_QuerySocketStatus WIFI Get reply time out 1");
		}
		else
		{
			length = WIFI_SERIAL.read(&WIFI_SERIAL,0, recv, 255);
			//printhexmsg(ECU_DBG_WIFI,"WIFI_QuerySocketStatus", recv, length);
			if( (length > 0) && 
				  (recv[0] == 0x65)&&
					(recv[1] == send[1])&&
					(recv[2] == 0x06)
				)
			{
				
				if(recv[4] == 0x01)
				{
					printmsg(ECU_DBG_WIFI,"WIFI_QuerySocketStatus Connect");
					rt_mutex_release(WIFI_lock);
					return 1;
				}else if(recv[4] == 0x00)
				{
					printmsg(ECU_DBG_WIFI,"WIFI_QuerySocketStatus Disconnect");
					rt_mutex_release(WIFI_lock);
					return 0;
				}else
				{
					//查询连接失败
					printmsg(ECU_DBG_WIFI,"WIFI_QuerySocketStatus Failed");
					//rt_mutex_release(WIFI_lock);
					//return -1;
				}
				
			}else
			{
				//查询连接失败
				printmsg(ECU_DBG_WIFI,"WIFI_QuerySocketStatus Failed");
				//rt_mutex_release(WIFI_lock);
				//return -1;
			}
		}
	}
	rt_mutex_release(WIFI_lock);
	return -1;
}

#if 1
#ifdef RT_USING_FINSH
#include <finsh.h>

void testWIFIRecv(SocketType Type,int timeout)	//无线接收测试
{
	char data[2048] = {0};
	int length = 0;
	length = RecvSocketData(Type,data,timeout);
	rt_kprintf("WiFi_RecvData:%d   %s\n",length,&data[9]);
}
FINSH_FUNCTION_EXPORT(testWIFIRecv , WIFI Recv Test.)


void WIFIRecvTest(SocketType Type)
{
	char *data = NULL;
	int length = 0;
	data = malloc(2048);

	//while(1)
	{
		memset(data,0x00,2048);
		length = RecvSocketData(Type,data,5);
		if(!memcmp(data,"quit",4))
		{
			free(data);
			return;
		}
		printf("WIFIRecvTest: %d\n",length);
		printf("%s\n",&data[9]);
		
	}
	free(data);
}
FINSH_FUNCTION_EXPORT(WIFIRecvTest , WIFI Recv Test.)



FINSH_FUNCTION_EXPORT(AT , Into AT Mode.)
FINSH_FUNCTION_EXPORT(WiFi_Open , Open WIFI Modle.)
FINSH_FUNCTION_EXPORT(AT_ENTM , Into Last Mode.)
FINSH_FUNCTION_EXPORT(AT_VER , Get WIFI SoftWare Version.)
FINSH_FUNCTION_EXPORT(AT_Z , Reset WIFI Modle.)
FINSH_FUNCTION_EXPORT(AT_RELD , Reload the default setting and reboot.)
FINSH_FUNCTION_EXPORT(AT_NETP , Set SOCKET A Configure.)

FINSH_FUNCTION_EXPORT(AT_TCPB_ON , TCPB ON.)
FINSH_FUNCTION_EXPORT(AT_TCPADDB , Set SOCKET B IP.)
FINSH_FUNCTION_EXPORT(AT_TCPPTB , Set SOCKET B PORT.)

FINSH_FUNCTION_EXPORT(AT_TCPC_ON , TCPC ON.)
FINSH_FUNCTION_EXPORT(AT_TCPADDC , Set SOCKET C IP.)
FINSH_FUNCTION_EXPORT(AT_TCPPTC , Set SOCKET C PORT.)

FINSH_FUNCTION_EXPORT(AT_TCPTOB , Set SOCKET B TIMEOUT.)
FINSH_FUNCTION_EXPORT(AT_TCPTOC , Set SOCKET C TIMEOUT.)

FINSH_FUNCTION_EXPORT(AT_FAPSTA_ON , Set AP+STA Mode.)
FINSH_FUNCTION_EXPORT(AT_WMODE , Set Modle Mode.)
FINSH_FUNCTION_EXPORT(AT_WSSSID , Set STA SSID.)
FINSH_FUNCTION_EXPORT(AT_WSKEY , Set STA Key.)

FINSH_FUNCTION_EXPORT(SendToSocketB , Send SOCKET B.)
FINSH_FUNCTION_EXPORT(SendToSocketC , Send SOCKET C.)

FINSH_FUNCTION_EXPORT(initWorkIP , init Work Mode.)
	
FINSH_FUNCTION_EXPORT(WIFI_Create , Wifi Create Socket.)
FINSH_FUNCTION_EXPORT(WIFI_Close , Wifi Close Socket.)
FINSH_FUNCTION_EXPORT(WIFI_QueryStatus , Wifi Query Socket Status.)


#endif
#endif

